### <center> Тема “Вычисления с помощью Numpy”

<font color='blue'>**Задание 1** <br>
Импортируйте библиотеку Numpy и дайте ей псевдоним np.
Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов.
Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем считать,
что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее значение по
каждому признаку, используя метод mean массива Numpy. Результат запишите в массив mean_a, в
нем должно быть 2 элемента.

In [14]:
import numpy as np

In [15]:
b = np.array([[1, 2, 3, 3, 1], 
              [6, 8, 11, 10, 7]])
a = b.T
print(a)

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]

In [16]:
mean_a = a.mean(axis=0)
print(mean_a)

[2.  8.4]

<font color='blue'>**Задание 2** <br>
Вычислите массив a_centered, отняв от значений массива “а” средние значения соответствующих
признаков, содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие.
Получившийся массив должен иметь размер 5x2.

In [17]:
a_centered = a - mean_a
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

<font color='blue'>**Задание 3** <br>
Найдите скалярное произведение столбцов массива a_centered. В результате должна получиться
величина a_centered_sp. Затем поделите a_centered_sp на N-1, где N - число наблюдений.

In [18]:
a_centered_sp = a_centered.T[0] @ a_centered.T[1]
print(a_centered_sp)

8.0

In [19]:
cov = a_centered_sp / (a_centered.shape[0] - 1)
cov

2.0

<font color='blue'>**Задание 4**<br>
В этом задании проверьте получившееся число, вычислив ковариацию еще одним способом - с
помощью функции np.cov. В качестве аргумента m функция np.cov должна принимать
транспонированный массив “a”. В получившейся ковариационной матрице (массив Numpy размером
2x2) искомое значение ковариации будет равно элементу в строке с индексом 0 и столбце с индексом
1.

In [20]:
cov_ = np.cov(a_centered.T)
cov_[0,1]

2.0

### <center> Тема “Работа с данными в Pandas”

<font color='blue'>**Задание 1** <br>
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. <br>
Создайте датафрейм **authors** со столбцами ***author_id*** и ***author_name***, в которых соответственно содержатся данные: <br>
[1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].<br>
Затем создайте датафрейм **book** cо столбцами ***author_id***, ***book_title*** и ***price***, в которых соответственно
содержатся данные:
[1, 1, 1, 2, 2, 3, 3],<br>
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и
поклонники'],<br>
[450, 300, 350, 500, 450, 370, 290].

In [21]:
import pandas as pd

In [22]:
authors = pd.DataFrame({'author_id':[1,2,3], 'author_name':['Тургенев', 'Чехов', 'Островский']})
authors.head(3)

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [23]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 
                     'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 
                                   'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 
                                   'Таланты и поклонники'],
                     'price':[450, 300, 350, 500, 450, 370, 290] })
book.head(3)

   author_id         book_title  price
0          1        Отцы и дети    450
1          1              Рудин    300
2          1  Дворянское гнездо    350

<font color='blue'>**Задание 2<br>**
Получите датафрейм **authors_price**, соединив датафреймы **authors** и **books** по полю ***author_id***.

In [24]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

<font color='blue'> **Задание 3<br>**
Создайте датафрейм **top5**, в котором содержатся строки из **authors_price** с пятью самыми дорогими
книгами.

In [25]:
top5 = authors_price.nlargest(5,'price')
top5 = top5.sort_values('author_id')
top5 = top5.reset_index(drop=True)
top5

   author_id author_name         book_title  price
0          1    Тургенев        Отцы и дети    450
1          1    Тургенев  Дворянское гнездо    350
2          2       Чехов   Толстый и тонкий    500
3          2       Чехов    Дама с собачкой    450
4          3  Островский              Гроза    370

<font color='blue'> **Задание 4<br>**
Создайте датафрейм **authors_stat** на основе информации из **authors_price**.<br>
В датафрейме **authors_stat** должны быть четыре столбца:<br>
***author_name***, ***min_price***, ***max_price*** и ***mean_price***,<br>
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [26]:
authors_stat = pd.DataFrame()
authors_stat['min_price'] = authors_price.groupby('author_name').agg({'price': 'min'})
authors_stat['max_price'] = authors_price.groupby('author_name').agg({'price': 'max'})
authors_stat['mean_price'] = round(authors_price.groupby('author_name').agg({'price': 'mean'}),1)
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370       330.0
Тургенев           300        450       366.7
Чехов              450        500       475.0

<font color='blue'> **Задание 5``**<br>
- Создайте новый столбец в датафрейме **authors_price** под названием ***cover***, в нем будут располагаться
данные о том, какая обложка у данной книги - твердая или мягкая.<br>
- В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
- Просмотрите документацию по функции **pd.pivot_table** с помощью вопросительного знака. <br> 
- Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого
функцию **pd.pivot_table**. При этом столбцы должны называться "твердая" и "мягкая", а индексами
должны быть фамилии авторов. <br>
- Пропущенные значения стоимостей заполните нулями, принеобходимости загрузите библиотеку Numpy.
- Назовите полученный датасет ***book_info*** и сохраните его в формат pickle под названием
"book_info.pkl". <br>
- Затем загрузите из этого файла датафрейм и назовите его book_info2.<br> 
- Удостоверьтесь,что датафреймы book_info и book_info2 идентичны.

In [27]:
authors_price['cover'] =  ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [28]:
?pd.pivot_table

In [29]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'], columns=['cover'], aggfunc=np.sum)
book_info['мягкая'].fillna(0, inplace=True)
book_info['твердая'].fillna(0, inplace=True)
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [30]:
book_info.to_pickle('book_info.pkl')

In [31]:
book_info2 = pd.read_pickle('book_info.pkl')
book_info2

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [32]:
book_info == book_info2

cover        мягкая  твердая
author_name
Островский     True     True
Тургенев       True     True
Чехов          True     True

## End of task